<a href="https://colab.research.google.com/github/HarshESC/Company-Churn-Supervised-Learning-Analysis/blob/main/Mobile_User_Demographics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

3[TalkingData Mobile User Demographics
](https://www.kaggle.com/c/talkingdata-mobile-user-demographics)
## 1. Introduction.

Nothing is more comforting than being greeted by your favorite drink just as you walk through the door of the corner café. While a thoughtful barista knows you take a macchiato every Wednesday morning at 8:15, it’s much more difficult in a digital space for your preferred brands to personalize your experience.

TalkingData, China’s largest third-party mobile data platform, understands that everyday choices and behaviors paint a picture of who we are and what we value. TalkingData is seeking to leverage behavioral data from more than 70% of the 500 million mobile devices active daily in China to help its clients better understand and interact with their audiences.


## 2, Audience.

### Exploratory Data Analysis

In [ ]:
from google.colab import drive 
drive.mount('/content/gdrive')
import os
os.environ['KAGGLE_CONFIG_DIR'] = "/content/gdrive/"
%cd "/content/gdrive/My Drive/Final Capstone"
import pandas as pd

Mounted at /content/gdrive
/content/gdrive/My Drive/Final Capstone

In [ ]:
app_data = pd.read_csv('app_labels.csv')
app_data.head()

                app_id  label_id
0  7324884708820027918       251
1 -4494216993218550286       251
2  6058196446775239644       406
3  6058196446775239644       407
4  8694625920731541625       406

In [ ]:
events = pd.read_csv('events.csv')
events.head()

   event_id            device_id            timestamp  longitude  latitude
0         1    29182687948017175  2016-05-01 00:55:25     121.38     31.24
1         2 -6401643145415154744  2016-05-01 00:54:12     103.65     30.97
2         3 -4833982096941402721  2016-05-01 00:08:05     106.60     29.70
3         4 -6815121365017318426  2016-05-01 00:06:40     104.27     23.28
4         5 -5373797595892518570  2016-05-01 00:07:18     115.88     28.66

In [ ]:
GATest = pd.read_csv('gender_age_test.csv')
GATest.head()

             device_id
0  1002079943728939269
1 -1547860181818787117
2  7374582448058474277
3 -6220210354783429585
4 -5893464122623104785

In [ ]:
GATrain = pd.read_csv('gender_age_train.csv')
GATrain.head()

             device_id gender  age   group
0 -8076087639492063270      M   35  M32-38
1 -2897161552818060146      M   35  M32-38
2 -8260683887967679142      M   35  M32-38
3 -4938849341048082022      M   30  M29-31
4   245133531816851882      M   30  M29-31

In [ ]:
GATrain['gender'].value_counts()

M    47904
F    26741
Name: gender, dtype: int64

In [ ]:
GATrain['group'].value_counts()

M23-26    9605
M32-38    9476
M39+      8581
M22-      7488
M29-31    7309
F33-42    5561
M27-28    5445
F23-      5050
F29-32    4628
F43+      4194
F24-26    4190
F27-28    3118
Name: group, dtype: int64

In [ ]:
GATrain.nunique()

device_id    74645
gender           2
age             85
group           12
dtype: int64

In [ ]:
label_categories = pd.read_csv('label_categories.csv')
label_categories.head()

   label_id           category
0         1                NaN
1         2     game-game type
2         3   game-Game themes
3         4     game-Art Style
4         5  game-Leisure time

In [ ]:
# Check for nulls
label_categories.isnull().sum()*100/label_categories.isnull().count()

label_id    0.000000
category    0.322581
dtype: float64

In [ ]:
#Drop nulls and see how many observations we have:
label_categories.dropna(inplace=True)
label_categories.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 927 entries, 1 to 929
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   label_id  927 non-null    int64
 1   category  927 non-null    object
dtypes: int64(1), object(1)
memory usage: 21.7+ KB

In [ ]:
label_categories.head()

   label_id             category
1         2       game-game type
2         3     game-Game themes
3         4       game-Art Style
4         5    game-Leisure time
5         6  game-Cutting things

In [ ]:
label_categories.nunique()

label_id    927
category    835
dtype: int64

In [ ]:
phone_brand_device_model = pd.read_csv('phone_brand_device_model.csv')
phone_brand_device_model.head()

             device_id phone_brand   device_model
0 -8890648629457979026          小米             红米
1  1277779817574759137          小米           MI 2
2  5137427614288105724          三星      Galaxy S4
3  3669464369358936369       SUGAR           时尚手机
4 -5019277647504317457          三星  Galaxy Note 2

In [ ]:
phone_brand_device_model.nunique()

device_id       186716
phone_brand        131
device_model      1599
dtype: int64

In [ ]:
phone_brand_device_model['device_model'].value_counts()

红米note           7358
MI 3             5712
MI 2S            5308
Galaxy Note 3    5019
MI 4             4798
                 ...
S100                1
B8080-F             1
ivvi 小i Plus        1
Moto Turbo          1
Y210-2010           1
Name: device_model, Length: 1599, dtype: int64

In [ ]:
sample_submission = pd.read_csv('sample_submission.csv')
sample_submission.head()

             device_id    F23-  F24-26  F27-28  ...  M27-28  M29-31  M32-38    M39+
0  1002079943728939269  0.0833  0.0833  0.0833  ...  0.0833  0.0833  0.0833  0.0833
1 -1547860181818787117  0.0833  0.0833  0.0833  ...  0.0833  0.0833  0.0833  0.0833
2  7374582448058474277  0.0833  0.0833  0.0833  ...  0.0833  0.0833  0.0833  0.0833
3 -6220210354783429585  0.0833  0.0833  0.0833  ...  0.0833  0.0833  0.0833  0.0833
4 -5893464122623104785  0.0833  0.0833  0.0833  ...  0.0833  0.0833  0.0833  0.0833

[5 rows x 13 columns]